export const writingPromptsMock = {
  "opinion-essay": {
    prompt:
      "تجربه‌ای را توصیف کن که باعث شد دیدگاهت نسبت به یک موضوع تغییر کند.",

    instructions: [
      "حداقل 150 کلمه بنویس.",
      "از مثال واقعی استفاده کن.",
      "نتیجه‌گیری مشخص داشته باش.",
    ],

    targetWords: 150,
  },

  "formal-email": {
    prompt: "یک ایمیل رسمی برای درخواست اطلاعات از یک مؤسسه آموزشی بنویس.",

    instructions: [
      "لحن رسمی حفظ شود.",
      "درخواست شفاف باشد.",
      "از ساختار استاندارد ایمیل استفاده کن.",
    ],

    targetWords: 120,
  },

  "disagree-esssy": {
    prompt: "به یک نظر مخالف با استدلال منطقی و محترمانه پاسخ بده.",

    instructions: [
      "نظر طرف مقابل را خلاصه کن.",
      "حداقل دو استدلال ارائه بده.",
      "جمع‌بندی داشته باش.",
    ],

    targetWords: 180,
  },

  "story-writing": {
    prompt: "بهترین خاطره ات با دوستت را برای یک شخص سوم شرح بده",

    instructions: [
      "مقدمه چینی کن و بگو چرا این خاطره را تعریف میکنی",
      "لحن مناسب گفت و گو را حفظ کن",
      "جمع‌بندی داشته باش.",
    ],

    targetWords: 250,
  },
  "daily-journal": {
    prompt: "یک مشکل روزمره را تحلیل کن و برای آن راه‌حل ارائه بده.",

    instructions: [
      "علت‌ها را توضیح بده.",
      "پیامدها را بررسی کن.",
      "راه‌حل عملی پیشنهاد کن.",
    ],

    targetWords: 250,
  },
  "solution-writing": {
    prompt: "یک مشکل ساده و قابل حل را تحلیل کن و برای آن راه‌حل ارائه بده.",

    instructions: [
      "علت‌ها را توضیح بده.",
      "پیامدها را بررسی کن.",
      "راه‌حل عملی پیشنهاد کن.",
    ],

    targetWords: 250,
  },
};
